Revit 2024 API
FamilyPointLocation Class
 Data corresponding to the point locations in certain types of Family Symbols.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class FamilyPointLocation : APIObject
Visual Basic
Public Class FamilyPointLocation _
	Inherits APIObject
Visual C++
public ref class FamilyPointLocation : public APIObject
Remarks
 Examples of FamilySymbol objects that contain placement references are Panels and Flexible Components.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FamilyPointLocation
See Also
FamilyPointLocation Members
Autodesk.Revit.DB Namespace